; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v8 - type_1 ?v2 - type_3)
 	      (pred_1 ?v3 - object ?v2 - type_3)
	      (pred_4 ?v8 - type_1 ?v5 - type_2)
	      (pred_2 ?v8 - type_1 ?v3 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v8 - type_1 ?v1 ?v6 - type_3)
       :precondition (and  (pred_3 ?v8 ?v1))
       :effect (and  (pred_3 ?v8 ?v6)
		     (not (pred_3 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_1 ?v7 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v4) (pred_3 ?v8 ?v4) (pred_4 ?v8 ?v5))
       :effect (and (pred_2 ?v8 ?v7 ?v5)
		    (not (pred_1 ?v7 ?v4)) 
		    (not (pred_4 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_1 ?v7 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v7 ?v5) (pred_3 ?v8 ?v4))
       :effect (and (pred_1 ?v7 ?v4)
		    (pred_4 ?v8 ?v5)
		    (not (pred_2 ?v8 ?v7 ?v5)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_1
obj_10 obj_07 - type_2
obj_02 obj_03 obj_09 obj_06 - type_3
obj_01 obj_08 obj_04 - object)
(:init
(pred_3 obj_05 obj_03)
(pred_4 obj_05 obj_10)
(pred_4 obj_05 obj_07)
(pred_1 obj_01 obj_02)
(pred_1 obj_08 obj_02)
(pred_1 obj_04 obj_06)
)
(:goal
(and
(pred_1 obj_01 obj_02)
(pred_1 obj_08 obj_06)
(pred_1 obj_04 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_05 ?b obj_07))))
)
)

; plan
1. (op_2 obj_05 obj_03 obj_02)
   deleted: (pred_3 obj_05 obj_03)
   added: (pred_3 obj_05 obj_02)
   goals met: 1 of 3
2. (op_1 obj_05 obj_08 obj_02 obj_10)
   deleted: (pred_1 obj_08 obj_02) (pred_4 obj_05 obj_10)
   added: (pred_2 obj_05 obj_08 obj_10)
   goals met: 1 of 3
3. (op_2 obj_05 obj_02 obj_06)
   deleted: (pred_3 obj_05 obj_02)
   added: (pred_3 obj_05 obj_06)
   goals met: 1 of 3
4. (op_3 obj_05 obj_08 obj_06 obj_10)
   deleted: (pred_2 obj_05 obj_08 obj_10)
   added: (pred_1 obj_08 obj_06) (pred_4 obj_05 obj_10)
   goals met: 2 of 3
5. (op_1 obj_05 obj_04 obj_06 obj_10)
   deleted: (pred_1 obj_04 obj_06) (pred_4 obj_05 obj_10)
   added: (pred_2 obj_05 obj_04 obj_10)
   goals met: 2 of 3
6. (op_2 obj_05 obj_06 obj_03)
   deleted: (pred_3 obj_05 obj_06)
   added: (pred_3 obj_05 obj_03)
   goals met: 2 of 3
7. (op_3 obj_05 obj_04 obj_03 obj_10)
   deleted: (pred_2 obj_05 obj_04 obj_10)
   added: (pred_1 obj_04 obj_03) (pred_4 obj_05 obj_10)
   goals met: 3 of 3
